---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.Clear
source: html/61223a8a-8379-4c23-3073-4b3d13ae7ab7.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```